## Clusters Terraform Plan
  ```terraform
  
#########################################################
##
##   Planning changes for dev environment...
##
#########################################################

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.external_secrets[0].kubernetes_manifest.cluster_secrets[0] will be updated in-place
  ~ resource "kubernetes_manifest" "cluster_secrets" {
      ~ manifest = {
          ~ spec       = {
              ~ externalSecretSpec = {
                  ~ data            = [
                        # (11 unchanged elements hidden)
                        {
                            remoteRef = {
                                key      = "GITLAB_TOKEN"
                                property = "data.GITLAB_TOKEN"
                            }
                            secretKey = "GITLAB_TOKEN"
                        },
                      + {
                          + remoteRef = {
                              + key      = "HARBOR_KEY"
                              + property = "data.HARBOR_KEY"
                            }
                          + secretKey = "HARBOR_KEY"
                        },
                    ]
                    # (3 unchanged attributes hidden)
                }
                # (3 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
      ~ object   = {
          ~ spec       = {
              ~ externalSecretSpec     = {
                  ~ data            = [
                        # (11 unchanged elements hidden)
                        {
                            remoteRef = {
                                conversionStrategy = "Default"
                                decodingStrategy   = "None"
                                key                = "GITLAB_TOKEN"
                                metadataPolicy     = "None"
                                property           = "data.GITLAB_TOKEN"
                                version            = null
                            }
                            secretKey = "GITLAB_TOKEN"
                            sourceRef = {
                                generatorRef = {
                                    apiVersion = null
                                    kind       = null
                                    name       = null
                                }
                                storeRef     = {
                                    kind = null
                                    name = null
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "HARBOR_KEY"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.HARBOR_KEY"
                              + version            = (known after apply)
                            }
                          + secretKey = "HARBOR_KEY"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                    ]
                    # (4 unchanged attributes hidden)
                }
                # (6 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
    }

Plan: 0 to add, 1 to change, 0 to destroy.

#########################################################
##
##   Planning changes for stg environment...
##
#########################################################

#########################################################
##
##   Planning changes for prod environment...
##
#########################################################

#########################################################
##
##   Planning changes for sandbox environment...
##
#########################################################

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  - destroy

Terraform will perform the following actions:

  # module.registry[0].kubernetes_deployment.registry will be destroyed
  # (because module.registry[0] is not in configuration)
  - resource "kubernetes_deployment" "registry" {
      - id               = "registry/registry" -> null
      - wait_for_rollout = true -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 10 -> null
          - labels           = {
              - "app" = "registry"
            } -> null
          - name             = "registry" -> null
          - namespace        = "registry" -> null
          - resource_version = "32115769" -> null
          - uid              = "b0e5be1f-a3e8-4227-8e3f-6de5d7e73c5f" -> null
            # (1 unchanged attribute hidden)
        }

      - spec {
          - min_ready_seconds         = 0 -> null
          - paused                    = false -> null
          - progress_deadline_seconds = 600 -> null
          - replicas                  = "1" -> null
          - revision_history_limit    = 10 -> null

          - selector {
              - match_labels = {
                  - "app" = "registry"
                } -> null
            }

          - strategy {
              - type = "RollingUpdate" -> null

              - rolling_update {
                  - max_surge       = "25%" -> null
                  - max_unavailable = "25%" -> null
                }
            }

          - template {
              - metadata {
                  - annotations      = {} -> null
                  - generation       = 0 -> null
                  - labels           = {
                      - "app" = "registry"
                    } -> null
                    name             = null
                    # (4 unchanged attributes hidden)
                }
              - spec {
                  - active_deadline_seconds          = 0 -> null
                  - automount_service_account_token  = true -> null
                  - dns_policy                       = "ClusterFirst" -> null
                  - enable_service_links             = true -> null
                  - host_ipc                         = false -> null
                  - host_network                     = false -> null
                  - host_pid                         = false -> null
                  - node_selector                    = {} -> null
                  - restart_policy                   = "Always" -> null
                  - scheduler_name                   = "default-scheduler" -> null
                  - share_process_namespace          = false -> null
                  - termination_grace_period_seconds = 30 -> null
                    # (6 unchanged attributes hidden)

                  - container {
                      - args                       = [] -> null
                      - command                    = [] -> null
                      - image                      = "registry:2" -> null
                      - image_pull_policy          = "IfNotPresent" -> null
                      - name                       = "registry" -> null
                      - stdin                      = false -> null
                      - stdin_once                 = false -> null
                      - termination_message_path   = "/dev/termination-log" -> null
                      - termination_message_policy = "File" -> null
                      - tty                        = false -> null
                        # (1 unchanged attribute hidden)

                      - env {
                          - name  = "REGISTRY_STORAGE_DELETE_ENABLED" -> null
                          - value = "true" -> null
                        }

                      - port {
                          - container_port = 5000 -> null
                          - host_port      = 0 -> null
                            name           = null
                          - protocol       = "TCP" -> null
                            # (1 unchanged attribute hidden)
                        }

                      - resources {
                          - limits   = {
                              - "cpu"    = "200m"
                              - "memory" = "256Mi"
                            } -> null
                          - requests = {
                              - "cpu"    = "100m"
                              - "memory" = "128Mi"
                            } -> null
                        }

                      - volume_mount {
                          - mount_path        = "/var/lib/registry" -> null
                          - mount_propagation = "None" -> null
                          - name              = "registry-storage" -> null
                          - read_only         = false -> null
                            # (1 unchanged attribute hidden)
                        }
                    }

                  - volume {
                      - name = "registry-storage" -> null

                      - persistent_volume_claim {
                          - claim_name = "registry-storage" -> null
                          - read_only  = false -> null
                        }
                    }
                }
            }
        }
    }

  # module.registry[0].kubernetes_service.registry will be destroyed
  # (because module.registry[0] is not in configuration)
  - resource "kubernetes_service" "registry" {
      - id                     = "registry/registry" -> null
      - status                 = [
          - {
              - load_balancer = [
                  - {
                      - ingress = []
                    },
                ]
            },
        ] -> null
      - wait_for_load_balancer = true -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "registry" -> null
          - namespace        = "registry" -> null
          - resource_version = "12912408" -> null
          - uid              = "b78da603-4cd3-4e14-b5c4-7b0ee7c23478" -> null
            # (1 unchanged attribute hidden)
        }

      - spec {
          - allocate_load_balancer_node_ports = true -> null
          - cluster_ip                        = "10.99.205.135" -> null
          - cluster_ips                       = [
              - "10.99.205.135",
            ] -> null
          - external_ips                      = [] -> null
          - health_check_node_port            = 0 -> null
          - internal_traffic_policy           = "Cluster" -> null
          - ip_families                       = [
              - "IPv4",
            ] -> null
          - ip_family_policy                  = "SingleStack" -> null
          - load_balancer_source_ranges       = [] -> null
          - publish_not_ready_addresses       = false -> null
          - selector                          = {
              - "app" = "registry"
            } -> null
          - session_affinity                  = "None" -> null
          - type                              = "ClusterIP" -> null
            # (4 unchanged attributes hidden)

          - port {
                name         = null
              - node_port    = 0 -> null
              - port         = 5000 -> null
              - protocol     = "TCP" -> null
              - target_port  = "5000" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.registry[0].module.ingress[0].kubernetes_ingress_v1.this[0] will be destroyed
  # (because module.registry[0].module.ingress[0] is not in configuration)
  - resource "kubernetes_ingress_v1" "this" {
      - id     = "registry/ingress-registry" -> null
      - status = [
          - {
              - load_balancer = [
                  - {
                      - ingress = [
                          - {
                              - ip       = "192.168.1.40"
                                # (1 unchanged attribute hidden)
                            },
                        ]
                    },
                ]
            },
        ] -> null

      - metadata {
          - annotations      = {
              - "cert-manager.io/cluster-issuer"                 = "letsencrypt-prod"
              - "external-dns.alpha.kubernetes.io/hostname"      = "registry.fullstack.pw"
              - "nginx.ingress.kubernetes.io/proxy-body-size"    = "0"
              - "nginx.ingress.kubernetes.io/proxy-read-timeout" = "600"
              - "nginx.ingress.kubernetes.io/proxy-send-timeout" = "600"
              - "nginx.ingress.kubernetes.io/ssl-redirect"       = "true"
              - "nginx.org/client-max-body-size"                 = "0"
            } -> null
          - generation       = 3 -> null
          - labels           = {} -> null
          - name             = "ingress-registry" -> null
          - namespace        = "registry" -> null
          - resource_version = "29849796" -> null
          - uid              = "e7714b09-9d8a-43ea-998f-e688b8e960f5" -> null
            # (1 unchanged attribute hidden)
        }

      - spec {
          - ingress_class_name = "nginx" -> null

          - rule {
              - host = "registry.fullstack.pw" -> null

              - http {
                  - path {
                      - path      = "/" -> null
                      - path_type = "Prefix" -> null

                      - backend {
                          - service {
                              - name = "registry" -> null

                              - port {
                                    name   = null
                                  - number = 5000 -> null
                                }
                            }
                        }
                    }
                }
            }

          - tls {
              - hosts       = [
                  - "registry.fullstack.pw",
                ] -> null
              - secret_name = "registry-tls" -> null
            }
        }
    }

  # module.registry[0].module.namespace.kubernetes_namespace.this[0] will be destroyed
  # (because module.registry[0].module.namespace is not in configuration)
  - resource "kubernetes_namespace" "this" {
      - id                               = "registry" -> null
      - wait_for_default_service_account = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "registry" -> null
          - resource_version = "27588822" -> null
          - uid              = "556fd1c7-a221-4089-b7a9-dfc36a4d52f0" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.registry[0].module.persistence.kubernetes_persistent_volume_claim.this[0] will be destroyed
  # (because module.registry[0].module.persistence is not in configuration)
  - resource "kubernetes_persistent_volume_claim" "this" {
      - id               = "registry/registry-storage" -> null
      - wait_until_bound = true -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "registry-storage" -> null
          - namespace        = "registry" -> null
          - resource_version = "12911910" -> null
          - uid              = "6e296ff0-53e2-45fe-93f6-6d8b8b7db2e3" -> null
            # (1 unchanged attribute hidden)
        }

      - spec {
          - access_modes       = [
              - "ReadWriteOnce",
            ] -> null
          - storage_class_name = "local-path" -> null
          - volume_mode        = "Filesystem" -> null
          - volume_name        = "pvc-6e296ff0-53e2-45fe-93f6-6d8b8b7db2e3" -> null

          - resources {
              - limits   = {} -> null
              - requests = {
                  - "storage" = "10Gi"
                } -> null
            }
        }
    }

Plan: 0 to add, 0 to change, 5 to destroy.

#########################################################
##
##   Planning changes for tools environment...
##
#########################################################

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.external_secrets[0].kubernetes_manifest.cluster_secrets[0] will be updated in-place
  ~ resource "kubernetes_manifest" "cluster_secrets" {
      ~ manifest = {
          ~ spec       = {
              ~ externalSecretSpec = {
                  ~ data            = [
                        # (11 unchanged elements hidden)
                        {
                            remoteRef = {
                                key      = "GITLAB_TOKEN"
                                property = "data.GITLAB_TOKEN"
                            }
                            secretKey = "GITLAB_TOKEN"
                        },
                      + {
                          + remoteRef = {
                              + key      = "HARBOR_KEY"
                              + property = "data.HARBOR_KEY"
                            }
                          + secretKey = "HARBOR_KEY"
                        },
                    ]
                    # (3 unchanged attributes hidden)
                }
                # (3 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
      ~ object   = {
          ~ spec       = {
              ~ externalSecretSpec     = {
                  ~ data            = [
                        # (11 unchanged elements hidden)
                        {
                            remoteRef = {
                                conversionStrategy = "Default"
                                decodingStrategy   = "None"
                                key                = "GITLAB_TOKEN"
                                metadataPolicy     = "None"
                                property           = "data.GITLAB_TOKEN"
                                version            = null
                            }
                            secretKey = "GITLAB_TOKEN"
                            sourceRef = {
                                generatorRef = {
                                    apiVersion = null
                                    kind       = null
                                    name       = null
                                }
                                storeRef     = {
                                    kind = null
                                    name = null
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "HARBOR_KEY"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.HARBOR_KEY"
                              + version            = (known after apply)
                            }
                          + secretKey = "HARBOR_KEY"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                    ]
                    # (4 unchanged attributes hidden)
                }
                # (6 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
    }

Plan: 0 to add, 1 to change, 0 to destroy.

  ```
  
  Plan exit code: 0
  